-- phpMyAdmin SQL Dump
-- version 4.6.5.2
-- https://www.phpmyadmin.net/
--
-- Хост: 127.0.0.1
-- Время создания: Ноя 18 2017 г., 16:34
-- Версия сервера: 10.1.21-MariaDB
-- Версия PHP: 5.6.30

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- База данных: `test_laravel`
--

-- --------------------------------------------------------

--
-- Структура таблицы `migrations`
--

CREATE TABLE `migrations` (
  `id` int(10) UNSIGNED NOT NULL,
  `migration` varchar(191) COLLATE utf8mb4_unicode_ci NOT NULL,
  `batch` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Дамп данных таблицы `migrations`
--

INSERT INTO `migrations` (`id`, `migration`, `batch`) VALUES
(13, '2017_11_17_092614_update_test_table', 2),
(20, '2014_10_12_000000_create_users_table', 3),
(21, '2014_10_12_100000_create_password_resets_table', 3),
(22, '2017_11_15_130930_create_test_table', 3);

-- --------------------------------------------------------

--
-- Структура таблицы `password_resets`
--

CREATE TABLE `password_resets` (
  `email` varchar(191) COLLATE utf8mb4_unicode_ci NOT NULL,
  `token` varchar(191) COLLATE utf8mb4_unicode_ci NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Структура таблицы `test_table`
--

CREATE TABLE `test_table` (
  `id` int(10) UNSIGNED NOT NULL,
  `parent_id` varchar(191) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `full_name` varchar(191) COLLATE utf8mb4_unicode_ci NOT NULL,
  `position` varchar(191) COLLATE utf8mb4_unicode_ci NOT NULL,
  `salary` int(11) NOT NULL,
  `date` date NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Дамп данных таблицы `test_table`
--

INSERT INTO `test_table` (`id`, `parent_id`, `full_name`, `position`, `salary`, `date`, `created_at`, `updated_at`) VALUES
(1, '0', 'Ермаков Феликс Борисович', 'директор', 25117, '1976-03-19', '2017-11-17 10:27:02', '2017-11-17 10:27:02'),
(2, '1', 'Виктор Александрович Субботин', 'зам. директора', 22096, '2017-11-17', '2017-11-17 10:28:09', '2017-11-17 10:28:09'),
(3, '1', 'Евдокимов Владлен Романович', 'зам. директора', 23171, '2017-11-17', '2017-11-17 10:28:09', '2017-11-17 10:28:09'),
(4, '1', 'Вадим Романович Максимов', 'зам. директора', 24949, '2017-11-17', '2017-11-17 10:28:09', '2017-11-17 10:28:09'),
(5, '1', 'Фёдоров Вячеслав Евгеньевич', 'зам. директора', 24895, '2017-11-17', '2017-11-17 10:28:09', '2017-11-17 10:28:09'),
(6, '1', 'Макар Дмитриевич Казаков', 'зам. директора', 24423, '2017-11-17', '2017-11-17 10:28:09', '2017-11-17 10:28:09'),
(7, '4', 'Сысоев Рафаил Борисович', 'начальник отдела', 21343, '2012-01-20', '2017-11-17 10:29:19', '2017-11-17 10:29:19'),
(8, '3', 'Константин Александрович Миронов', 'начальник отдела', 21223, '1972-05-25', '2017-11-17 10:29:19', '2017-11-17 10:29:19'),
(9, '6', 'Сава Владимирович Константинов', 'начальник отдела', 19196, '1986-03-24', '2017-11-17 10:29:19', '2017-11-17 10:29:19'),
(10, '5', 'Тетерин Роберт Фёдорович', 'начальник отдела', 19174, '2012-05-16', '2017-11-17 10:29:19', '2017-11-17 10:29:19'),
(11, '2', 'Нестор Владимирович Котов', 'начальник отдела', 20173, '1992-12-06', '2017-11-17 10:29:19', '2017-11-17 10:29:19'),
(12, '2', 'Валерий Дмитриевич Дьячков', 'начальник отдела', 20119, '2008-07-05', '2017-11-17 10:29:19', '2017-11-17 10:29:19'),
(13, '4', 'Иммануил Владимирович Шилов', 'начальник отдела', 20547, '1997-07-06', '2017-11-17 10:29:19', '2017-11-17 10:29:19'),
(14, '5', 'Кирилл Борисович Никифоров', 'начальник отдела', 18372, '2003-05-30', '2017-11-17 10:29:19', '2017-11-17 10:29:19'),
(15, '5', 'Аполлон Александрович Харитонов', 'начальник отдела', 18155, '1983-01-05', '2017-11-17 10:29:19', '2017-11-17 10:29:19'),
(16, '3', 'Арсений Фёдорович Горбачёв', 'начальник отдела', 18714, '1973-09-26', '2017-11-17 10:29:19', '2017-11-17 10:29:19'),
(17, '3', 'Семён Максимович Лапин', 'начальник отдела', 19765, '1994-10-12', '2017-11-17 10:29:19', '2017-11-17 10:29:19'),
(18, '2', 'Виктор Иванович Рябов', 'начальник отдела', 18352, '1972-01-08', '2017-11-17 10:29:19', '2017-11-17 10:29:19'),
(19, '5', 'Самсонов Юрий Львович', 'начальник отдела', 21677, '1973-11-22', '2017-11-17 10:29:19', '2017-11-17 10:29:19'),
(20, '4', 'Гавриил Романович Попов', 'начальник отдела', 18885, '1996-11-04', '2017-11-17 10:29:19', '2017-11-17 10:29:19'),
(21, '4', 'Дроздов Иннокентий Максимович', 'начальник отдела', 21540, '2008-06-24', '2017-11-17 10:29:19', '2017-11-17 10:29:19'),
(22, '18', 'Валентин Фёдорович Крылов', 'начальник бригады', 16879, '1970-04-02', '2017-11-17 10:29:48', '2017-11-17 10:29:48'),
(23, '11', 'Кузьма Иванович Муравьёв', 'начальник бригады', 17989, '1972-04-12', '2017-11-17 10:29:49', '2017-11-17 10:29:49'),
(24, '20', 'Сидоров Эдуард Алексеевич', 'начальник бригады', 15598, '2001-06-27', '2017-11-17 10:29:49', '2017-11-17 10:29:49'),
(25, '7', 'Жуков Дмитрий Андреевич', 'начальник бригады', 15156, '1994-10-23', '2017-11-17 10:29:49', '2017-11-17 10:29:49'),
(26, '21', 'Виктор Алексеевич Миронов', 'начальник бригады', 15895, '1979-02-13', '2017-11-17 10:29:49', '2017-11-17 10:29:49'),
(27, '16', 'Илларион Андреевич Гаврилов', 'начальник бригады', 17115, '1987-04-29', '2017-11-17 10:29:49', '2017-11-17 10:29:49'),
(28, '8', 'Нестеров Ираклий Дмитриевич', 'начальник бригады', 17076, '2013-05-05', '2017-11-17 10:29:49', '2017-11-17 10:29:49'),
(29, '11', 'Роберт Борисович Романов', 'начальник бригады', 15087, '1982-07-30', '2017-11-17 10:29:49', '2017-11-17 10:29:49'),
(30, '16', 'Сорокин Николай Александрович', 'начальник бригады', 16236, '2006-12-01', '2017-11-17 10:29:49', '2017-11-17 10:29:49'),
(31, '17', 'Ян Львович Ефремов', 'начальник бригады', 17306, '1992-07-05', '2017-11-17 10:29:49', '2017-11-17 10:29:49'),
(32, '21', 'Новиков Иван Алексеевич', 'начальник бригады', 16671, '2005-11-13', '2017-11-17 10:29:49', '2017-11-17 10:29:49'),
(33, '17', 'Воробьёв Савва Алексеевич', 'начальник бригады', 17536, '1980-09-08', '2017-11-17 10:29:49', '2017-11-17 10:29:49'),
(34, '18', 'Марк Алексеевич Беляков', 'начальник бригады', 17735, '1981-04-27', '2017-11-17 10:29:49', '2017-11-17 10:29:49'),
(35, '15', 'Зыков Аполлон Владимирович', 'начальник бригады', 17524, '1983-07-23', '2017-11-17 10:29:49', '2017-11-17 10:29:49'),
(36, '10', 'Родион Сергеевич Блохин', 'начальник бригады', 15241, '1990-07-12', '2017-11-17 10:29:49', '2017-11-17 10:29:49'),
(37, '13', 'Журавлёв Валерий Фёдорович', 'начальник бригады', 15187, '1992-12-31', '2017-11-17 10:29:49', '2017-11-17 10:29:49'),
(38, '15', 'Антон Борисович Давыдов', 'начальник бригады', 16827, '2013-07-04', '2017-11-17 10:29:49', '2017-11-17 10:29:49'),
(39, '11', 'Максим Андреевич Гусев', 'начальник бригады', 15841, '2015-05-24', '2017-11-17 10:29:49', '2017-11-17 10:29:49'),
(40, '15', 'Влад Фёдорович Громов', 'начальник бригады', 15813, '1975-05-20', '2017-11-17 10:29:49', '2017-11-17 10:29:49'),
(41, '9', 'Рафаил Борисович Медведев', 'начальник бригады', 17267, '2011-04-15', '2017-11-17 10:29:49', '2017-11-17 10:29:49'),
(42, '67', 'Егоров Давид Дмитриевич', 'инженер', 9053, '1994-02-05', '2017-11-17 10:30:14', '2017-11-17 10:30:14'),
(43, '53', 'Никонов Святослав Андреевич', 'рабочий', 10240, '1985-02-16', '2017-11-17 10:30:14', '2017-11-17 10:30:14'),
(44, '35', 'Сава Иванович Филиппов', 'рабочий', 11818, '1999-05-14', '2017-11-17 10:30:14', '2017-11-17 10:30:14'),
(45, '36', 'Данила Львович Исаев', 'инженер', 14402, '1990-06-06', '2017-11-17 10:30:14', '2017-11-17 10:30:14'),
(46, '69', 'Спартак Дмитриевич Беспалов', 'рабочий', 12828, '2000-01-15', '2017-11-17 10:30:15', '2017-11-17 10:30:15'),
(47, '45', 'Юрий Романович Андреев', 'рабочий', 11397, '1970-05-05', '2017-11-17 10:30:15', '2017-11-17 10:30:15'),
(48, '44', 'Тимофей Фёдорович Ефимов', 'инженер', 12134, '2015-03-20', '2017-11-17 10:30:15', '2017-11-17 10:30:15'),
(49, '49', 'Артемий Андреевич Герасимов', 'инженер', 9359, '1981-10-27', '2017-11-17 10:30:15', '2017-11-17 10:30:15'),
(50, '60', 'Яков Владимирович Ершов', 'инженер', 8953, '1999-06-23', '2017-11-17 10:30:15', '2017-11-17 10:30:15'),
(51, '40', 'Николаев Дмитрий Дмитриевич', 'рабочий', 8413, '2001-05-18', '2017-11-17 10:30:15', '2017-11-17 10:30:15'),
(52, '50', 'Сава Фёдорович Зуев', 'рабочий', 14355, '2007-12-16', '2017-11-17 10:30:15', '2017-11-17 10:30:15'),
(53, '61', 'Герасимов Валентин Александрович', 'рабочий', 7481, '2017-09-15', '2017-11-17 10:30:15', '2017-11-17 10:30:15'),
(54, '35', 'Аким Владимирович Николаев', 'инженер', 10437, '1989-05-23', '2017-11-17 10:30:15', '2017-11-17 10:30:15'),
(55, '68', 'Гаврилов Иван Максимович', 'рабочий', 8320, '1997-05-19', '2017-11-17 10:30:15', '2017-11-17 10:30:15'),
(56, '26', 'Дмитрий Владимирович Евсеев', 'инженер', 5768, '1973-09-04', '2017-11-17 10:30:15', '2017-11-17 10:30:15'),
(57, '32', 'Дмитриев Глеб Владимирович', 'инженер', 12812, '1973-01-29', '2017-11-17 10:30:15', '2017-11-17 10:30:15'),
(58, '81', 'Воробьёв Марк Фёдорович', 'рабочий', 11027, '2011-02-13', '2017-11-17 10:30:15', '2017-11-17 10:30:15'),
(59, '49', 'Михеев Савва Максимович', 'инженер', 9158, '1974-04-22', '2017-11-17 10:30:15', '2017-11-17 10:30:15'),
(60, '34', 'Вячеслав Евгеньевич Корнилов', 'инженер', 9289, '1996-05-03', '2017-11-17 10:30:15', '2017-11-17 10:30:15'),
(61, '71', 'Максим Дмитриевич Субботин', 'рабочий', 6497, '1999-05-20', '2017-11-17 10:30:15', '2017-11-17 10:30:15'),
(62, '68', 'Кудряшов Артемий Евгеньевич', 'инженер', 9322, '2004-04-28', '2017-11-17 10:30:15', '2017-11-17 10:30:15'),
(63, '26', 'Ковалёв Даниил Алексеевич', 'инженер', 5827, '1981-08-03', '2017-11-17 10:30:15', '2017-11-17 10:30:15'),
(64, '49', 'Гущин Валериан Дмитриевич', 'инженер', 5024, '2007-09-24', '2017-11-17 10:30:15', '2017-11-17 10:30:15'),
(65, '57', 'Олег Фёдорович Мясников', 'инженер', 8015, '1984-05-26', '2017-11-17 10:30:15', '2017-11-17 10:30:15'),
(66, '27', 'Быков Даниил Алексеевич', 'инженер', 5144, '1994-09-29', '2017-11-17 10:30:15', '2017-11-17 10:30:15'),
(67, '79', 'Лаврентий Борисович Аксёнов', 'инженер', 7789, '2016-07-26', '2017-11-17 10:30:15', '2017-11-17 10:30:15'),
(68, '50', 'Трофимов Артём Львович', 'рабочий', 13544, '2005-04-07', '2017-11-17 10:30:15', '2017-11-17 10:30:15'),
(69, '62', 'Савин Матвей Борисович', 'инженер', 6101, '1984-05-06', '2017-11-17 10:30:15', '2017-11-17 10:30:15'),
(70, '41', 'Герасимов Игнат Фёдорович', 'рабочий', 5242, '2001-08-31', '2017-11-17 10:30:15', '2017-11-17 10:30:15'),
(71, '42', 'Соловьёв Иммануил Евгеньевич', 'инженер', 10530, '1990-03-18', '2017-11-17 10:30:15', '2017-11-17 10:30:15'),
(72, '60', 'Борис Романович Кошелев', 'инженер', 6990, '1977-08-17', '2017-11-17 10:30:15', '2017-11-17 10:30:15'),
(73, '43', 'Соколов Тарас Львович', 'инженер', 13986, '1980-01-17', '2017-11-17 10:30:15', '2017-11-17 10:30:15'),
(74, '24', 'Макаров Иван Дмитриевич', 'рабочий', 12995, '2007-06-02', '2017-11-17 10:30:15', '2017-11-17 10:30:15'),
(75, '35', 'Блинов Бронислав Евгеньевич', 'рабочий', 14163, '2008-02-24', '2017-11-17 10:30:15', '2017-11-17 10:30:15'),
(76, '48', 'Игнатий Иванович Брагин', 'инженер', 7588, '1972-11-26', '2017-11-17 10:30:15', '2017-11-17 10:30:15'),
(77, '53', 'Фёдор Владимирович Крюков', 'инженер', 10949, '2015-03-05', '2017-11-17 10:30:15', '2017-11-17 10:30:15'),
(78, '26', 'Донат Борисович Зимин', 'инженер', 5488, '1999-07-06', '2017-11-17 10:30:15', '2017-11-17 10:30:15'),
(79, '78', 'Тимур Алексеевич Юдин', 'рабочий', 11915, '2000-05-08', '2017-11-17 10:30:15', '2017-11-17 10:30:15'),
(80, '37', 'Кузьмин Милан Романович', 'инженер', 14979, '2015-12-23', '2017-11-17 10:30:16', '2017-11-17 10:30:16'),
(81, '61', 'Игнатов Герман Александрович', 'инженер', 7541, '1981-10-31', '2017-11-17 10:30:16', '2017-11-17 10:30:16'),
(82, '45', 'Волков Юлиан Борисович', 'рабочий', 13964, '1990-05-08', '2017-11-17 10:30:16', '2017-11-17 10:30:16'),
(83, '24', 'Иннокентий Сергеевич Поляков', 'рабочий', 6155, '1972-12-11', '2017-11-17 10:30:16', '2017-11-17 10:30:16'),
(84, '70', 'Матвей Львович Павлов', 'инженер', 9826, '1975-09-02', '2017-11-17 10:30:16', '2017-11-17 10:30:16'),
(85, '46', 'Аким Евгеньевич Кулаков', 'рабочий', 8101, '2005-11-29', '2017-11-17 10:30:16', '2017-11-17 10:30:16'),
(86, '67', 'Анатолий Евгеньевич Уваров', 'рабочий', 8053, '2001-10-20', '2017-11-17 10:30:16', '2017-11-17 10:30:16'),
(87, '32', 'Илларион Львович Кудряшов', 'рабочий', 7845, '1992-10-01', '2017-11-17 10:30:16', '2017-11-17 10:30:16'),
(88, '56', 'Чернов Игорь Владимирович', 'инженер', 12474, '2002-05-21', '2017-11-17 10:30:16', '2017-11-17 10:30:16'),
(89, '75', 'Аполлон Иванович Иванов', 'рабочий', 6856, '1983-10-24', '2017-11-17 10:30:16', '2017-11-17 10:30:16'),
(90, '28', 'Алексей Дмитриевич Волков', 'инженер', 7632, '2005-04-24', '2017-11-17 10:30:16', '2017-11-17 10:30:16'),
(91, '60', 'Галкин Спартак Борисович', 'инженер', 13062, '2006-07-16', '2017-11-17 10:30:16', '2017-11-17 10:30:16'),
(92, '68', 'Кононов Трофим Львович', 'рабочий', 12310, '1978-11-11', '2017-11-17 10:30:16', '2017-11-17 10:30:16'),
(93, '40', 'Исаев Макар Александрович', 'рабочий', 8294, '2006-06-29', '2017-11-17 10:30:16', '2017-11-17 10:30:16'),
(94, '54', 'Блохин Николай Фёдорович', 'рабочий', 10955, '2003-03-31', '2017-11-17 10:30:16', '2017-11-17 10:30:16'),
(95, '49', 'Иванов Руслан Романович', 'рабочий', 10555, '1981-05-13', '2017-11-17 10:30:16', '2017-11-17 10:30:16'),
(96, '56', 'Лапин Спартак Александрович', 'рабочий', 14000, '1975-08-20', '2017-11-17 10:30:16', '2017-11-17 10:30:16'),
(97, '28', 'Никита Львович Петров', 'рабочий', 9373, '1983-07-01', '2017-11-17 10:30:16', '2017-11-17 10:30:16'),
(98, '49', 'Филипп Львович Ефимов', 'инженер', 12259, '2009-06-10', '2017-11-17 10:30:16', '2017-11-17 10:30:16'),
(99, '27', 'Семён Львович Дорофеев', 'инженер', 7052, '1973-08-06', '2017-11-17 10:30:16', '2017-11-17 10:30:16'),
(100, '43', 'Казаков Трофим Максимович', 'инженер', 6086, '2006-06-28', '2017-11-17 10:30:16', '2017-11-17 10:30:16'),
(101, '46', 'Донат Романович Костин', 'рабочий', 7430, '1997-06-17', '2017-11-17 10:30:16', '2017-11-17 10:30:16');

-- --------------------------------------------------------

--
-- Структура таблицы `users`
--

CREATE TABLE `users` (
  `id` int(10) UNSIGNED NOT NULL,
  `name` varchar(191) COLLATE utf8mb4_unicode_ci NOT NULL,
  `email` varchar(191) COLLATE utf8mb4_unicode_ci NOT NULL,
  `password` varchar(191) COLLATE utf8mb4_unicode_ci NOT NULL,
  `remember_token` varchar(100) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Дамп данных таблицы `users`
--

INSERT INTO `users` (`id`, `name`, `email`, `password`, `remember_token`, `created_at`, `updated_at`) VALUES
(1, 'Tolyk', 'dt150685@gmail.com', '$2y$10$87iFuL9Dkj0WK4EIzo9vcOjRnd6rhSmmwFaQ8K7EIDtHWuEpqSJL.', NULL, '2017-11-17 11:01:22', '2017-11-17 11:01:22');

--
-- Индексы сохранённых таблиц
--

--
-- Индексы таблицы `migrations`
--
ALTER TABLE `migrations`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `password_resets`
--
ALTER TABLE `password_resets`
  ADD KEY `password_resets_email_index` (`email`);

--
-- Индексы таблицы `test_table`
--
ALTER TABLE `test_table`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `users`
--
ALTER TABLE `users`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `users_email_unique` (`email`);

--
-- AUTO_INCREMENT для сохранённых таблиц
--

--
-- AUTO_INCREMENT для таблицы `migrations`
--
ALTER TABLE `migrations`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=23;
--
-- AUTO_INCREMENT для таблицы `test_table`
--
ALTER TABLE `test_table`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=102;
--
-- AUTO_INCREMENT для таблицы `users`
--
ALTER TABLE `users`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
